plots/backups-plots/presentation-graalos/single-experiment/results/java/gv-shopcart-niuk-process-benchmark-1-1-2048/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        113 bytes

Concurrency Level:      1
Time taken for tests:   3.200 seconds
Complete requests:      10000
Failed requests:        9990
   (Connect: 0, Receive: 0, Length: 9990, Exceptions: 0)
Total transferred:      2072834 bytes
Total body sent:        2030000
HTML transferred:       1112834 bytes
Requests per second:    3124.97 [#/sec] (mean)
Time per request:       0.320 [ms] (mean)
Time per request:       0.320 [ms] (mean, across all concurrent requests)
Transfer rate:          632.57 [Kbytes/sec] received
                        619.50 kb/s sent
                        1252.08 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0      17
Processing:     0    0   1.0      0      29
Waiting:        0    0   0.9      0      29
Total:          0    0   1.0      0      29

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%     29 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        113 bytes

Concurrency Level:      1
Time taken for tests:   3.308 seconds
Complete requests:      10000
Failed requests:        9973
   (Connect: 0, Receive: 0, Length: 9973, Exceptions: 0)
Total transferred:      2072933 bytes
Total body sent:        2030000
HTML transferred:       1112933 bytes
Requests per second:    3022.79 [#/sec] (mean)
Time per request:       0.331 [ms] (mean)
Time per request:       0.331 [ms] (mean, across all concurrent requests)
Transfer rate:          611.92 [Kbytes/sec] received
                        599.24 kb/s sent
                        1211.16 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      19
Processing:     0    0   0.9      0      21
Waiting:        0    0   0.8      0      19
Total:          0    0   1.0      0      21

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%     21 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        113 bytes

Concurrency Level:      1
Time taken for tests:   3.472 seconds
Complete requests:      10000
Failed requests:        9963
   (Connect: 0, Receive: 0, Length: 9963, Exceptions: 0)
Total transferred:      2074101 bytes
Total body sent:        2030000
HTML transferred:       1114101 bytes
Requests per second:    2880.02 [#/sec] (mean)
Time per request:       0.347 [ms] (mean)
Time per request:       0.347 [ms] (mean, across all concurrent requests)
Transfer rate:          583.35 [Kbytes/sec] received
                        570.94 kb/s sent
                        1154.29 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0      18
Processing:     0    0   0.9      0      23
Waiting:        0    0   0.7      0      19
Total:          0    0   1.0      0      23

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%     23 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        113 bytes

Concurrency Level:      1
Time taken for tests:   3.420 seconds
Complete requests:      10000
Failed requests:        9969
   (Connect: 0, Receive: 0, Length: 9969, Exceptions: 0)
Total transferred:      2073665 bytes
Total body sent:        2030000
HTML transferred:       1113665 bytes
Requests per second:    2923.57 [#/sec] (mean)
Time per request:       0.342 [ms] (mean)
Time per request:       0.342 [ms] (mean, across all concurrent requests)
Transfer rate:          592.04 [Kbytes/sec] received
                        579.58 kb/s sent
                        1171.62 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      18
Processing:     0    0   0.9      0      20
Waiting:        0    0   0.7      0      20
Total:          0    0   1.0      0      20

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%     20 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        113 bytes

Concurrency Level:      1
Time taken for tests:   3.424 seconds
Complete requests:      10000
Failed requests:        9962
   (Connect: 0, Receive: 0, Length: 9962, Exceptions: 0)
Total transferred:      2072795 bytes
Total body sent:        2030000
HTML transferred:       1112795 bytes
Requests per second:    2920.68 [#/sec] (mean)
Time per request:       0.342 [ms] (mean)
Time per request:       0.342 [ms] (mean, across all concurrent requests)
Transfer rate:          591.21 [Kbytes/sec] received
                        579.00 kb/s sent
                        1170.21 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0      21
Processing:     0    0   0.9      0      23
Waiting:        0    0   0.8      0      23
Total:          0    0   1.1      0      25

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      0
  99%      1
 100%     25 (longest request)